[{"pk": 1, "model": "news.news", "fields": {"external_news_link": "", "title": "Newly Launched Alberta Bus Service & Coach Bus Transportation | MyEBus.ca", "text": "<h3><strong>Albertans Will Now Have New Daily Scheduled Passenger Bus Service!<br /> ebus launches Thursday, October 20th</strong></h3>\r\n<p><strong>&nbsp;</strong></p>\r\n<p>(Edmonton) &ndash; ebus will launch its Edmonton, Red Deer and Calgary daily scheduled passenger bus service on Thursday, October 20th. Albertans now have a choice.</p>\r\n<p>The new ebus passenger service is in direct response to the Provincial Government&rsquo;s Alberta Transportation Bus Modernization Program. ebus is the first new bus service to offer multiple daily trips in over 30 years.</p>\r\n<p><br /> ebus, General Manager, John Stepovy notes \"the public deserves an economical and safe transportation alternative and ebus will offer passengers a new schedule, economical fares, onboard Wireless Internet (Wi-Fi), 110V power-outlets, lap belts and excellent service.\"</p>\r\n<p><br /> The initial ebus schedule offers passengers a variety of departure options, including; four (4) departures from Edmonton and Calgary (Sunday-Monday-Thursday-Friday), three (3) departures (Tuesday-Wednesday), two (2) departures Saturday. All departures include pick up and drop off in Red Deer.</p>\r\n<p><br /> \"As part of our commitment to provide economical fares, ebus is offering Webfares,\" says Stepovy.&nbsp; \"Passengers will automatically receive a $5 dollar saving every time they book online and people can start booking their reservations effective Monday, October 17th\".</p>\r\n<p>Also, as part of its launch ebus will offer the first three seats on every departure for just $1 (one dollar)! The inaugural promotion will apply on all its schedules beginning October 20th and continue until November 30th.&nbsp; \"We are encouraging new passengers to sample our service and we believe our economical fares will definitely motivate more passengers to use ebus.&rdquo;</p>\r\n<p><br /> ebus will operate from Red Arrow Motorcoach offices and locations in Edmonton, Red Deer and Calgary and will also serve as Ticket Agent for ebus.&nbsp; &ldquo;As part of our planning we have heard and listened to Albertans and ebus is the travel alternative they want, it&rsquo;s economical, efficient, safe and available to everyone in the communities we serve,&rdquo; says Stepovy.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "ebus-launches-in-alberta", "teaser": "eBus has launched a new bus service in Alberta, with daily coach bus transportation to Calgary & Edmonton. Discover affordable bus service with eBus!", "publish_date": "2011-10-11", "display_order": 1}}, {"pk": 2, "model": "news.news", "fields": {"external_news_link": "", "title": "Our Calgary Bus Transportation Now Offers a Bus to CrossIron Mills | MyEBus.ca", "text": "<h3>As of January 9, 2012, ebus will begin <a title=\"CrossIron Mills Shuttle Service\" href=\"../../../../crossiron-mills\">service</a> to CrossIron Mills in Calgary.</h3>\r\n<p>&nbsp;</p>\r\n<p>The ebus - CrossIron Mills service will operate as follows:&nbsp; On all Southbound trips from Edmonton and Red Deer, the bus will stop at CrossIron Mills on request only. All Northbound trips out of Calgary to Red Deer and Edmonton will automatically stop at CrossIron Mills.&nbsp; Pick-up and drop-off location is Entrance #2 (Ranch Entrance).</p>\r\n<p>&nbsp;</p>", "image": "/customer_media/news/crossironmillslogo.jpg", "is_active": true, "slug": "ebus-crossiron-mills", "teaser": "As part of our Calgary bus route, eBus now offers a bus to CrossIron Mills. View our bus schedule to find the option that best fits your transportation needs.", "publish_date": "2012-01-05", "display_order": 1}}, {"pk": 3, "model": "news.news", "fields": {"external_news_link": "", "title": "Offering Low-Cost Bus Service to Fort McMurray | Coach Bus Travel | MyEBus.ca", "text": "<p><br />ebus will be expanding it's network in Alberta and is looking forward to providing it's low-cost, high-comfort bus transportation service to new communities.&nbsp; The newest bus route that is being added to the ebus schedule is Edmonton to Fort McMurray.&nbsp; The new service will begin on February 21st, 2012 and booking availability will begin on February 13th, 2012.</p>\r\n<p>&nbsp;</p>\r\n<p>The new route will run 3 times a week, on Tuesdays, Thursdays and Fridays from Edmonton to Fort McMurray.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>\"We are very excited to be able to respond to ebus customers' needs and expand our service to Fort McMurray so quickly.&nbsp; We've received positive response for the my ebus service to-date and look forward to expanding our network in order to further accommodate our customers' needs\", states General Manager, John Stepovy.</p>\r\n<p>&nbsp;</p>\r\n<p>The new bus route will continue to be serviced with ebus' current vehicles, which feature onboard Wireless Internet (Wi-Fi), 110V power-outlets and lap belts.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "ebus-begins-low-cost-bus-service-fort-mcmurray", "teaser": "eBus, a coach bus service offering affordable transportation in Alberta, now offers a bus from Edmonton to Fort McMurray three times a week.  ", "publish_date": "2012-02-10", "display_order": 1}}, {"pk": 4, "model": "news.news", "fields": {"external_news_link": "", "title": "Priority Seating", "text": "<p>In our on going effort to provide the best possible comfort and convenience for&nbsp; travelers, we now offer priority seating for seniors and disabled passengers.</p>\r\n<p>The first two rows on either side of the coach are designated as priority seating with a decal at the window ledge.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "priority-seating", "teaser": "ebus Now Offer's Priority Seating", "publish_date": "2012-07-23", "display_order": 1}}, {"pk": 5, "model": "news.news", "fields": {"external_news_link": "", "title": "New 7:15am Early Bird Trips From Fort McMurray to Edmonton", "text": "<div style=\"margin-top: 0; margin-bottom: 0;\">Our passengers have spoken - they want more trips at a more convenient time and they want to know that this service is available for booking when they want it, and at a reasonable price.&nbsp;&nbsp; We&rsquo;re in the people business and making our passengers happy is important. That&rsquo;s why ebus is introducing more trips between Edmonton and Fort McMurray than ever!</div>\r\n<p>&nbsp;</p>\r\n<div style=\"margin-top: 0; margin-bottom: 0;\">Early birds will appreciate the new ebus 7:15am departure from Fort McMurray to Edmonton.&nbsp; &nbsp;Not only does this ebus leave for Edmonton earlier than any other bus service, but you can connect to trips heading to Red Deer and Calgary earlier than ever.&nbsp; <strong>The safe and reliable Early Bird 7:15am ebus runs every Monday to Friday.</strong><strong>&nbsp; </strong>Now you can plan your day ahead, depart early and arrive in Edmonton in plenty of time for an afternoon appointment, a late lunch with friends, or an early start to your weekend in the city.&nbsp; If Edmonton is home, you&rsquo;ll be home earlier than ever to enjoy the rest of your day.</div>\r\n<p>&nbsp;</p>\r\n<div style=\"margin-top: 0; margin-bottom: 0;\">For those heading up to Fort McMurray from Edmonton ebus has introduced a new <strong>3:45pm departure running Sunday through Thursday.</strong>&nbsp; Beat the rush out of the city and wrap up your day with a relaxing trip north.</div>\r\n<p>&nbsp;</p>\r\n<div style=\"margin-top: 0; margin-bottom: 0;\">Every ebus is equipped with FREE WIFI, power outlets, and a convenient onboard restroom.&nbsp; Also, for your safety, each ebus seat has a lap belt.&nbsp; Combine all this with 30% more leg room and you&rsquo;re set for a safe, restful, and comfortable trip.</div>\r\n<p>&nbsp;</p>\r\n<div style=\"margin-top: 0; margin-bottom: 0;\">As John Stepovy, General Manager, says &ldquo;We want to make your trip be best travel experience we can.&nbsp; We&rsquo;re happy to offer these new trips between Edmonton and Fort McMurray, and we look forward to welcoming you onboard.&rdquo;</div>\r\n<p>&nbsp;</p>\r\n<div style=\"margin-top: 0; margin-bottom: 0;\">Check out the <a href=\"http://myebus.ca/ebus-fort-mcmurray-new-bus-service\" target=\"_blank\">Fort McMurray Schedule</a>, book your trip online and save $5.00 today!</div>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "new-715am-early-bird-trips-fort-mcmurray-edmonton", "teaser": "New Early Bird 7:15am Trips From Fort McMurray", "publish_date": "2013-02-22", "display_order": 1}}, {"pk": 6, "model": "news.news", "fields": {"external_news_link": "", "title": "New Service to  Beaver, Athabasca and Henday, Wapasu Lodges ", "text": "<p><strong><span style=\"font-size: small;\">ebus Announces New Service to&nbsp; Beaver, Athabasca and Henday, Wapasu Lodges&nbsp; </span></strong><br style=\"font-size: small;\" />&nbsp;<br /><span style=\"font-size: small;\">ebus, Alberta&rsquo;s economical, efficient and safe coach service is now serving the Beaver, Athabasca, Henday, Wapasu Lodges&nbsp; both to and from Edmonton with connections through to Calgary began on August 1, 2013.</span><br />&nbsp;<br /><span style=\"font-size: small;\">John Stepovy, General Manager, has this to say about this new service, &ldquo;We&rsquo;re really excited about being able to expand our services to the PTI lodges in the Fort McMurray area. These new trips are a great opportunity for us to further serve the communities of Alberta. We look forward to welcoming our new passengers on board.&rdquo;</span><br />&nbsp;<br /><span style=\"font-size: small;\">In addition to this new service, ebus continues to provide outstanding affordable transportation to Edmonton, Calgary, Red Deer, CrossIron Mills and Fort McMurray, with several stops in smaller Alberta communities such as Wandering River, Marianna Lakes, Grassland, St. Albert, and Athabasca. Every ebus is equipped with Free WIFI, power outlets, and a convenient on board restroom.&nbsp; For your safety and peace of mind, every ebus seat is equipped with a lap belt.&nbsp; Because we want our passengers to be extra comfortable, we also have 30% more leg room so you can stretch out and reclining seats to help you relax during your safe, restful, and comfortable trip with us.</span><br />&nbsp;<br /><span style=\"font-size: small;\">For fares and schedules check out the ebus schedule. You&rsquo;ll save $5.00 off your trip when you book your trip online.&nbsp; Visit ebus on Facebook at <a href=\"http://www.facebook.com/ebus3\" target=\"_blank\">www.facebook.com/ebus3</a> and follow us on <a href=\"http://www.twitter.com/travelebus\" target=\"_blank\">Twitter @travelebus</a> for more news, specials and contests.</span><br /><br /></p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "new-service-beaver-athabasca-and-henday-wapasu-lodges-starting-august-1-2013", "teaser": "New Service to  Beaver, Athabasca and Henday, Wapasu Lodges ", "publish_date": "2013-07-09", "display_order": 1}}, {"pk": 7, "model": "news.news", "fields": {"external_news_link": "", "title": "We'll Get You There - Summer Campaign", "text": "<h1>&nbsp;</h1>\r\n<h1 align=\"center\">We&rsquo;ll Get You There</h1>\r\n<h1 align=\"center\">Summer Campaign</h1>\r\n<p>Red Arrow and ebus in partnership with Travel Alberta is showcasing some of the best events happening in Alberta.&nbsp; With ebus traveling to the top destinations in the province, including Edmonton, Red Deer, Calgary, and Fort McMurray, experiencing the best events this province has to offer is as easy as booking a ticket and heading on the road to adventure.&nbsp;&nbsp; Take a look at some of the events and visit their websites, then book your seat on ebus. &nbsp;We&rsquo;ll get you there!</p>\r\n<p>&nbsp;</p>\r\n<h1><strong>Where to Stay:</strong></h1>\r\n<p><strong>iHotel </strong>(<a href=\"http://www.hi67.com\" target=\"_blank\">www.hi67.com</a>)</p>\r\n<p>Here&rsquo;s an idea.&nbsp; If you&rsquo;re traveling to/from Red Deer, stay at the iHotel!&nbsp; Red Arrow makes daily pick-up/drop-offs at this handy location at 6500 67 Street in Red Deer. What could be more convenient? Visit their website to see for yourself.</p>\r\n<p><strong>Holiday Inn Express Edmonton</strong> (<a href=\"http://www.hiexdowntown.com\" target=\"_blank\">www.hiexdowntown.com</a>)</p>\r\n<p>Summer in Edmonton means fun, festivals and friends.&nbsp; Make your travel arrangements simple. Take the Red Arrow to and from downtown Edmonton and stay at the Holiday Inn Express right next door to our Red Arrow downtown ticket office at 10010 104<sup>th</sup> Street, NW. The Holiday Inn Express offers 140 recently renovated guestrooms within walking distance to shopping, restaurants and movie theatres. They have jacuzzi suites, king sized beds and so much more. Check out their website for details.</p>\r\n<h1><strong>What to See and Do</strong><strong></strong></h1>\r\n<p><strong><img style=\"float: left; margin: 2px 7px;\" src=\"../../../../customer_media/from_fringe_with_love.jpg\" alt=\"\" width=\"200\" height=\"74\" />Edmonton Fringe Festival &ndash; August 15-25, 2013</strong></p>\r\n<p>The Edmonton International Fringe Theatre Festival is back in action, celebrating Bond&rsquo;s 50 years on screen. Join us for danger, excitement, adventure and theatre cutting across churches, bars and boudoirs in Old Strathcona and beyond at <strong><em>From Fringe with Love</em></strong>, August 15 &ndash; 25, 2013. The Fringe is the Number 1 target for SPECTRE-U: Special Executive for Comedy, Tears, Renegades and Entertainment &mdash; Unjuried and Uncensored! SPECTRE-U agents come from around the city, the country and the globe to charm Edmontonians of all ages with theatrical performances, plus busking acts, children&rsquo;s activities, vendors, artisans and more.&nbsp;The Festival, powered by Her Majesty&rsquo;s Volunteer Service, celebrates Fringe Theatre Adventures&rsquo; new vision that <em>everyone is fringing</em>!</p>\r\n<p>(<a href=\"http://www.fringetheatreadventurs.ca\">www.fringetheatreadventurs.ca</a>)</p>\r\n<p>&nbsp;</p>\r\n<p><strong><img style=\"margin: 2px 7px; float: left;\" src=\"../../../../customer_media/aamosgarrett.jpg\" alt=\"\" width=\"150\" height=\"194\" />Calgary International Blues Festival</strong> (<a href=\"http://www.%20Calgarybluesfest.com\" target=\"_blank\">www. Calgarybluesfest.com</a>)</p>\r\n<p>July 29-August 4</p>\r\n<p>The 9th annual Calgary International Blues Festival features a full week of the best in blues, culminating in 4 days and nights of non-stop music at Shaw Millenium Park (1220 9th Ave. SW). Starring renowned guitar great&nbsp; Jimmie Vaughan and the Tilt-A-Whirl Band featuring Lou Ann Barton,&nbsp; powerhouse singer&nbsp; Sista Monica ,&nbsp; Canadian giants&nbsp; Tom Lavin &amp; the Legendary Powder Blues,&nbsp; Motown classics&nbsp; Martha Reeves &amp; the Vandellas,&nbsp; Canadian icon&nbsp; Matt Minglewood and a host of other blues greats, get your dancin' shoes on and get ready for the time of your life!</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Calgary Chasing Summer Festival</strong> (<a href=\"http://www.chasingsummerfestival.com\">www.chasingsummerfestival.com</a>)</p>\r\n<p>August 9-10</p>\r\n<p>Prepare yourself for two days of incredible music!</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p><strong>Calgary GlobalFest</strong> (link: <a href=\"http://www.globalfest.ca\">www.globalfest.ca</a>)</p>\r\n<p>August 16-25</p>\r\n<p>GlobalFest burst onto the scene in 2003 with 10 cultural pavilions and three countries presenting pyromusicals in Calgary's very own international fireworks festival. On the fourth and final night of the festival, GlobalFest celebrated a remarkable accomplishment. The festival reached attendance of close to 100,000 in the very first year, making GlobalFest one of Calgary's top draws for local citizens and tourists alike. GlobalFest's mandate as a not-for-profit society is to produce an inclusive, world class, multi-faceted arts and culture festival that celebrates and showcases cultural diversity and artistic excellence within our communities and across the globe.</p>\r\n<p><strong><img style=\"margin: 3px 7px; vertical-align: middle;\" src=\"../../../../customer_media/banner-new.jpg\" alt=\"\" width=\"200\" height=\"71\" />Calgary xFest</strong> ( <a href=\"http://www.xfestcalgary.com\">www.xfestcalgary.com</a>)</p>\r\n<p>August 31-Sept1</p>\r\n<p>X-FEST returns for a third year at historic Fort Calgary. Produced by&nbsp;<a href=\"http://unionevents.com/\" target=\"_blank\">UnionEvents.com</a>&nbsp;and presented by Calgary&rsquo;s New Rock Alternative X92.9, X-FEST has become one of western Canada&rsquo;s premiere summer music events. Previous performers include Linkin Park, Jane&rsquo;s Addiction, fun., Silversun Pickups, The Joy Formidable, House of Pain, and Social Distortion. This year&rsquo;s event has grown to encompass the Labour Day Long Weekend, with two days of amazing modern rock to enjoy on&nbsp;August 31st and September 1st.</p>\r\n<h1><strong>More to Explore:</strong></h1>\r\n<p><strong><img style=\"margin: 3px 7px; vertical-align: middle;\" src=\"../../../../customer_media/galt-museum-outside.jpg\" alt=\"\" width=\"150\" height=\"200\" />Lethbridge Galt Museum</strong> (<a href=\"http://www.galtmuseum.com\" target=\"_blank\">www.galtmuseum.com</a>)</p>\r\n<p>Visit the Galt Museum in Lethbridge for a summer of events and tours for you and your entire family. The Galt Museum &amp; Archives engages and educates our communities in the human history of southwestern Alberta by preserving and sharing collections, stories and memories that define our collective identity and guide our future.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Lethbridge Helen Shuler Nature Centre</strong> ( link: <a href=\"http://www.lethbridge.ca/Things-To-Do/Nature-Centre/Pages/default.aspx\">http://www.lethbridge.ca/Things-To-Do/Nature-Centre/Pages/default.aspx</a>)</p>\r\n<p>Explore and enjoy the unique urban escape within minutes of downtown Lethbridge.&nbsp; Full summer program (link to pdf: <a href=\"http://www.lethbridge.ca/Things-To-Do/Nature-Centre/Documents/summer%20programs%202013.pdf\">http://www.lethbridge.ca/Things-To-Do/Nature-Centre/Documents/summer%20programs%202013.pdf</a>)&nbsp;&nbsp; Opened in 1982, the Helen Schuler Nature Centre is operated by the City of Lethbridge. In its first year of operation, over 8,500 people visited the Nature Centre and took part in the programs. By 1984,&nbsp;more space&nbsp;was needed, so an additional programming room and offices were added.&nbsp;The Nature Centre has changed and grown with the community, and now receives&nbsp;more than 30,000 visitors each year!</p>\r\n<p><strong><img style=\"margin: 3px 8px; vertical-align: middle;\" src=\"../../../../customer_media/abouthegarden.jpg\" alt=\"\" width=\"200\" height=\"133\" />Lethbridge Nikka Yuko Japanese Garden</strong> (<a href=\"http://www.nikkayuko.com\" target=\"_blank\">www.nikkayuko.com</a>)</p>\r\n<p>The Nikka Yuko Japanese Garden offers you an unforgettable experience, combining the beauty of nature in a serene setting. From the first spring blossom to the final autumn leaf, the Garden is an oasis of tranquility. Step through the entrance gate, leave the bustle of everyday city life behind, and refresh your senses. A host or hostess in traditional Japanese clothing will greet you and highlight the Garden's many features, or give you a guided tour.&nbsp;</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p><strong>Lethbridge Exhibition Park</strong><strong> (</strong><a href=\"http://www.%20Exhibitionpark.ca\" target=\"_blank\">www. Exhibitionpark.ca</a><strong>)</strong></p>\r\n<p>Exhibition Park, also known as Lethbridge &amp; District Exhibition, the fourth oldest Agriculture Society in Alberta. Since the first fair in 1897, it has hosted more than a century of agriculture, tradeshows, midways, rodeos, sporting events, and numerous special events. Visit the website for a full calendar of events</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Claresholm Fair Days</strong> (<a href=\"http://www.townofclaresholm.com\" target=\"_blank\">www.townofclaresholm.com</a>)</p>\r\n<p>August 9-11</p>\r\n<p>Join the town for a parade and events for the whole family over three days. This years Bench Show theme is &ldquo;4H- Head, Heart, Hands &amp; Health&rdquo;. More a full list of events please click here (link: <a href=\"http://www.townofclaresholm.com/visit/events-calendar/\">http://www.townofclaresholm.com/visit/events-calendar/</a>)</p>\r\n<p>&nbsp;</p>\r\n<p><strong><img style=\"margin-left: 5px; margin-right: 5px; vertical-align: middle;\" src=\"../../../../customer_media/fortmactourism.gif\" alt=\"\" width=\"210\" height=\"75\" />Fort McMurray Tourism</strong> &ndash; (<a href=\"http://www.fortmcmurraytourism.com\" target=\"_blank\">www.fortmcmurraytourism.com</a>)</p>\r\n<p>&nbsp;</p>\r\n<p>Fort McMurray is one of 11 communities that comprise the Regional Municipality of Wood Buffalo. The other communities in our region include Anzac, Conklin, Draper, Fort Chipewyan,&nbsp;Fort Fitzgerald, Fort McKay, Gregoire Lake Estates, Janvier, Mariana Lake and Saprae&nbsp;Creek Estates. What a great place to visit! For events and tourist information, please visit the main website.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "well-get-you-there-summer-campaign", "teaser": "Explore Alberta with ebus and Travel Alberta", "publish_date": "2013-07-28", "display_order": 1}}, {"pk": 8, "model": "news.news", "fields": {"external_news_link": "", "title": "New Service to Barge Landing Lodge and Creeburn Lake Lodge in Fort McMurray", "text": "<p><span style=\"font-size: small;\">ebus is announcing a new service to the Barge Landing Lodge and Creeburn Lake Lodge in Fort McMurray.&nbsp; This new service is in addition to the economical, efficient and safe coach services which started in August, 2013, going to Beaver, Athabasca, Henday and Wapasu Lodges which travel to and from Edmonton with connections to Calgary.</span><br /><br /><span style=\"font-size: small;\">John Stepovy, General Manager, says, &ldquo;Expanding our services to these camp communities in Alberta is a great opportunity to ease travel stress for their employees and guests, in turn eliminating some of the travel connections previously required. Our new service to Barge Landing and Creeburn Lake began September 18th and we&rsquo;re looking forward to getting to know our new passengers.&nbsp; We look forward to further expanding our services in Alberta.&rdquo;</span><br /><br /><span style=\"font-size: small;\">ebus is a great affordable travel option for Albertans. Every ebus is equipped with Free WIFI, power outlets, and a convenient on board restroom.&nbsp; For your safety and peace of mind, every ebus seat is equipped with a lap belt.&nbsp; Because we want our passengers to be extra comfortable, we also have 30% more leg room so you can stretch out and reclining seats to help you relax during your safe, restful, and comfortable trip with us.&nbsp; Need more flexibility with your travel? Check out our Flex Fare options.</span><br /><br /><span style=\"font-size: small;\">In addition to this new service, ebus continues to provide outstanding affordable transportation to Edmonton, Calgary, Red Deer, CrossIron Mills and Fort McMurray, with several stops in smaller Alberta communities such as Wandering River, Marianna Lakes, Grassland, St. Albert, and Athabasca.</span><br /><br /><span style=\"font-size: small;\"><strong>For fares and schedules check out the <a href=\"../../../../schedules\" target=\"_blank\">ebus schedule</a>.</strong>&nbsp; <strong>Save $5.00 off trips when booking a trip online. </strong></span></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><strong><span style=\"font-size: small;\">Follow us on Facebook <a href=\"http://www.facebook.com/ebus3\" target=\"_blank\">www.facebook.com/ebus3</a> and Twitter <a href=\"http://www.twitter.com/travelebus\" target=\"_blank\">@travelebus </a>for news, specials &amp; contests.</span></strong></p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "new-service-barge-landing-lodge-and-creeburn-lake-lodge-fort-mcmurray", "teaser": "New Service to Barge Landing Lodge and Creeburn Lake Lodge in Fort McMurray", "publish_date": "2013-09-19", "display_order": 1}}, {"pk": 9, "model": "news.news", "fields": {"external_news_link": "", "title": "New ebus Service to PTI Anzac Lodge, PTI Conklin Lodge, Conklin (Conklin Corners), and Lac La Biche", "text": "<h2><strong>EBUS ANNOUNCES NEW SERVICE ON HIGHWAY 881</strong></h2>\r\n<p>ebus Alberta&rsquo;s economical, efficient and safe daily scheduled service motorcoach company, has announced new services to PTI Anzac Lodge, PTI Conklin Lodge, Conklin (Conklin Corners), and Lac La Biche.</p>\r\n<p>The new ebus service will operate from the downtown Edmonton ticket office located at the Holiday Inn Express Plaza, 10014-104<sup>th</sup> street, to PTI Anzac Lodge and back the same day, every Wednesday, Thursday and Friday.</p>\r\n<p>John Stepovy, General Manager, states &ldquo;The expansion of our ebus to serve these communities is an exciting opportunity. Our new service begins on November 13<sup>th</sup>, in time for the busy travel season. In addition to providing service to these towns, this new ebus service will provide valuable transportation services to the many camp workers in the areas. Safety is our first Core Value and is at the heart of everything we do. We remain committed to providing excellent service and getting our passengers safely home. We look forward to welcoming our passengers on board these new routes.&rdquo;</p>\r\n<p>In addition to this new service, ebus continues to provide outstanding affordable transportation to Edmonton, Calgary, Red Deer, CrossIron Mills and Fort McMurray, with several stops in other Alberta communities such as Wandering River, Marianna Lakes, Grassland, St. Albert, and Athabasca. ebus also services Barge Landing Lodge, Creeburn Lake Lodge, and Beaver, Athabasca, Henday, and Wapasu Lodges in the Fort McMurray area.</p>\r\n<p>For full schedule information please visit our <a href=\"http://myebus.ca/schedules\" target=\"_blank\">schedules page</a>.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "ebus-announces-new-service-highway-881", "teaser": "New ebus Service to PTI Anzac Lodge, PTI Conklin Lodge, Conklin (Conklin Corners), and Lac La Biche", "publish_date": "2013-10-28", "display_order": 1}}, {"pk": 11, "model": "news.news", "fields": {"external_news_link": "", "title": "ebus Charter Service", "text": "<p>&nbsp;</p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">ebus, Alberta&rsquo;s economical, efficient and safe service is now offering private charter service, customized contract charter service and event shuttles throughout Alberta. </span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">&nbsp;</span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">The ebus modern fleet of motorcoaches and skilled professional coach operators make each trip enjoyable, with complimentary WIFI, power outlets, DVD player, and onboard lavatory.<span style=\"mso-spacerun: yes;\">&nbsp; </span>Each motorcoach can seat up to 48 passengers and, for your safety and peace of mind, each roomy seat has a lap belt.<span style=\"mso-spacerun: yes;\">&nbsp; </span></span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">&nbsp;</span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">Additional amenities such as prepackaged breakfast and lunches to go are also available special order. </span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">&nbsp;</span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">As an Alberta based company, taking your group to your destinations and safely home again is our pleasure. Our number one Core Value is your safety.<span style=\"mso-spacerun: yes;\">&nbsp; </span>With this commitment to outstanding customer service and to our passengers, ebus will exceed your expectations.</span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">&nbsp;</span></p>\r\n<p class=\"MsoNormal\"><span style=\"mso-fareast-font-family: 'Times New Roman'; mso-bidi-font-family: 'Times New Roman'; color: black;\">To request a quote for our private charter service, please email <a href=\"mailto:charters@myebus.ca\" target=\"_blank\">charters@myebus.ca</a></span></p>\r\n<p class=\"MsoNormal\"><span style=\"font-size: 10.0pt; font-family: 'Tahoma','sans-serif'; mso-fareast-font-family: 'Times New Roman'; color: black;\">&nbsp;</span></p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "ebus-charter-service", "teaser": "Private Charter Service Now Available From ebus", "publish_date": "2014-03-20", "display_order": 1}}, {"pk": 12, "model": "news.news", "fields": {"external_news_link": "", "title": "ebus Service to Edmonton International Airport", "text": "<h1 style=\"text-align: center;\">ebus Announces Expanded Service to Edmonton International Airport</h1>\r\n<p>(Edmonton) ebus is pleased to announce further expansion of their Alberta scheduled motorcoach service to include Edmonton International Airport starting May 9th, 2015. &ldquo;This is a great opportunity for Alberta travelers, &ldquo;says John Stepovy, Director of Sales and Business Development, Red Arrow &amp; ebus. &ldquo;Once again we have listened to our passengers&rsquo; suggestions. This new direct service to Edmonton International Airport will be very handy for those passengers making airline connections or simply traveling between Edmonton, Calgary and Red Deer. We&rsquo;re really excited about expanding this service to Alberta travelers.&rdquo;</p>\r\n<p><br />The ebus service will offer four trips daily, 7 days a week, through Edmonton International Airport. ebus will make stops at the airport at 12:00pm and 6:30pm for southbound passengers heading to Red Deer and Calgary, and 2:30pm and 9:15pm for northbound passengers traveling from Calgary and Red Deer. Detailed schedules and fares can be found on the ebus website at www.myebus.ca.</p>\r\n<p><br />ebus is known as Alberta&rsquo;s economical, efficient and safe coach transportation company, offering affordable fares with a $5.00 savings when trips are booked online. Each comfortable ebus coach offers complimentary WIFI, 48 reclining seats, power outlets, lap belts, on-board lavatory, and ample leg room and luggage space, along with the safety and peace of mind that comes along with Alberta&rsquo;s friendliest and most skilled drivers.</p>\r\n<p><br />&ldquo;We are delighted to support this great new option for Central and Southern Albertans to get to and from Edmonton International Airport&rdquo; says Kirstin Brown, Manager of Regional Sales Development at Edmonton International Airport.</p>\r\n<p><br />&ldquo;Working with the amazing team at Edmonton International Airport, we&rsquo;re excited to be able to expand our direct service from Edmonton, Red Deer and Calgary, to include the Edmonton International Airport,&rdquo; says John Stepovy. &ldquo;To the cost conscious traveler, ebus is an easy connection to EIA and its 60 plus non-stop destinations including Icelandair.&rdquo;</p>\r\n<p><br />With an extensive network of scheduled routes for reliable, safe transportation across the province, ebus specializes in daily scheduled motorcoach service to and from Edmonton, Red Deer, Calgary, Fort McMurray and CrossIron Mills, as well as direct service to and from camps in the Fort McMurray and Conklin regions. ebus also offers private charter and shuttle service throughout Alberta. ebus is operated by Red Arrow Motorcoach and is part of the Pacific Western Group of Companies.</p>\r\n<p><br /><strong>For more information and media contact:</strong></p>\r\n<p><br /><strong>John Stepovy</strong><br /><strong>Director of Sales and Business Development</strong><br /><strong>Red Arrow &amp; ebus</strong><br /><strong>Phone: 780.425.9451 Email: John@redarrow.ca</strong></p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "new-ebus-service-edmonton-international-airport", "teaser": "ebus Service to Edmonton International Airport Starts May 9th, 2015", "publish_date": "2015-04-13", "display_order": 3}}, {"pk": 13, "model": "news.news", "fields": {"external_news_link": "", "title": "Ready for an adventure? Let’s go to Iceland!", "text": "<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p><img style=\"float: left; margin-left: 10px; margin-right: 10px;\" src=\"../../../../customer_media/map_of_iceland.jpg\" alt=\"\" width=\"350\" height=\"263\" />This northern country has an area of only 102,775 kilometers (approx. 39,700 square miles) and a population of 329,000. Home to music, natural wonders, art, and world famous dining, Iceland is well worth exploring.&nbsp;&nbsp; Travelers from all around the world visit Iceland as either their main destination for a holiday or as a stop-over for a couple of days when traveling to/from Europe.&nbsp;<em> (Map courtesy of Lonely Planet)</em></p>\r\n<p><em><br /></em></p>\r\n<p><strong>Edmonton International Airport has direct service to Iceland via Icelandair.</strong></p>\r\n<p><strong><br /></strong></p>\r\n<p>The capital of Iceland is Reykjavik. This city is world famous for its history, natural beauty, culture and more.&nbsp; The population of Reykjavik is only around 120,000 so you can be assured you will not run into the expected capital city chaos you might find elsewhere.&nbsp; This is truly a city best explored on foot or on a bicycle. Take a walk through the Reykjavik Art Museum and the National Gallery, enjoy some popular local music, and end your day with the vibrant nightlight. Day-excursions from Reykjavik are popular and there is something for everyone and every taste. Horseback riding, rafting, cave exploration, whale watching, gallery tours, swimming, shopping, glacier hikes, are just a few of the exciting adventures sure to tempt you.&nbsp; Don&rsquo;t forget to consider taking a trip to the new music and conference centre, Harpa.</p>\r\n<p>&nbsp;</p>\r\n<p>Explore East Iceland, where lush farms, small fjords and islands, natural harbors and fishing villages await you. &nbsp;Europe&rsquo;s largest glacier, Vatnajokull, is found here. Don&rsquo;t let the quaint landscape fool you; look closer. Music and arts festivals draw people from around the world, making East Iceland a cultural hotspot.</p>\r\n<p>&nbsp;</p>\r\n<p>Head to West Iceland to discover Iceland&rsquo;s waterfalls, sleeping volcanoes and geologic wonders like no other place on Earth.&nbsp; Feel like going for a hike? Head to the Akranes and Hvalfjorour and see the highest waterfall in the country.&nbsp; Snaefellsjokull National Park and the famous Snaefellsjokull Glacier are must see. And for eco-tourists, Snaefellsnes received the 2008 Earth Check award for being a sustainable community. It&rsquo;s truly a must-see destination.</p>\r\n<p>&nbsp;</p>\r\n<p>The Westfjords, located in the North West of Iceland is mainly uninhabited and unspoiled wilderness. Considered one of the country&rsquo;s best kept secrets, this natural environment is captivating and perfect for photographers and explorers. This area is home to the birdcliff Latrabjarb, which is reported to hosts nearly half of the world&rsquo;s population of several bird species. It is also a nature reserve and safe haven for the Arctic Fox.</p>\r\n<p>&nbsp;</p>\r\n<p>The countries most visited tourist attractions are located along the South coast of Iceland. Fresh seafood, friendly people, charming towns, all awaits both adventurer and leisure traveler alike.&nbsp; Natural wonders such as Skogafoss Waterall, Jokulsarlon Glacial Lagoon, are easy to get to.&nbsp; Ready to grab a spectacular meal? The South of Iceland is known for its amazing restaurants and fresh seafood.</p>\r\n<p>&nbsp;</p>\r\n<p>The Keflavik International Airport is located in the famous Reykjanes Peninsula. This geothermal area is where the Hellisheioi Power Station is.&nbsp; Visitors can check out the geothermal energy exhibition and learn about the ways Iceland has harnessed the energy from the geothermal activity to generate electricity. The entire area is a geologists dream. Caves, lava fields, hot springs, volcanic craters, geothermal water, all showcase the power of the Earth.&nbsp; At the same time, this area is well known for its great restaurants, several museums and festivals.</p>\r\n<p>&nbsp;</p>\r\n<p>Head to the highlands of Iceland, located in the interior. This area is a natural mosaic mixing volcanoes, ice caps, hot springs, valleys and rocky deserts all I one place. Two mountain roads, Kjolur and Sprengisandur take you to a hilly expanse of breathtaking beauty. Take advantage of a guided tour in a 4x4 vehicle in the summer and make camp at the popular basecamp location in the woodland nature reserve Posmork.&nbsp; Want to rest your weary bones after a long day of exploring? The area of Landmannalauger has natural hot geothermal rivers travelers can bathe in.</p>\r\n<p>&nbsp;</p>\r\n<p>North Iceland is nothing but spectacular. Mountains, lava fields, lush vegetation contrasting against barren seasons, the contrast of environmental scenes is a photographer&rsquo;s dream.&nbsp; The northern latitude is close to the Arctic Circle, giving visitors breathtaking view of the midnight sun.</p>\r\n<p>&nbsp;</p>\r\n<p><span style=\"font-size: small;\"><strong>ebus offers direct service from Edmonton, Red Deer, and Calgary to Edmonton International Airport. From the airport hop Icelandair for a direct flight to Iceland and start your Icelandic adventure!</strong></span></p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "ready-adventure-lets-go-iceland", "teaser": "Head to Iceland from Edmonton International Airport", "publish_date": "2015-05-19", "display_order": 1}}, {"pk": 14, "model": "news.news", "fields": {"external_news_link": "", "title": "Ebus has a new look and now offers 5% off all online bookings", "text": "<p>(Edmonton) Ebus has changed its logo and now offers 5% off all trips booked through www.myebus.ca effective March 1st, 2016.</p>\r\n<p><br />&nbsp;&ldquo;In today&rsquo;s economy, we recognize that Albertans are looking for ways to save money. Our passengers know that Ebus is economical and a convenient, friendly choice, &ldquo;says John Stepovy, Director Sales and Business Development, Pacific Western Transportation. &ldquo;We are a proud 100% Alberta company driving Albertans to the communities we know best.&nbsp; We&rsquo;re local and we appreciate our passengers who choose to travel with us each and every day. &rdquo;</p>\r\n<p>&nbsp;</p>\r\n<p>Our updated branding is giving Ebus a fresher new look, but we want to assure our passengers that we are the same company focused on our Core Values of Safety, Customer Service, Resourcefulness, Integrity, Positive Attitude, Teamwork, Loyalty, Accountability, Respect and Dedication.</p>\r\n<p>&nbsp;</p>\r\n<p>With free WIFI and power outlets, and an extensive network of scheduled routes for reliable, safe transportation across the province, Ebus specializes in daily scheduled motorcoach service to and from Edmonton, Red Deer, Calgary, CrossIron Mills, and Edmonton International Airport. Ebus also offers private charter and shuttle service throughout Alberta. Ebus is operated by Red Arrow Motorcoach and is part of the Pacific Western Group of Companies.</p>\r\n<p>&nbsp;</p>\r\n<p>For more information and media contact:</p>\r\n<p>John Stepovy<br />Director of Sales and Business Development<br />Red Arrow &amp; Ebus<br />Phone: 780.425.9451 Email: John@corp.pwt.ca</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "ebus-has-new-look-and-now-offers-5-all-online-bookings", "teaser": "Ebus has a new look and now offers 5% off all online bookings", "publish_date": "2016-03-03", "display_order": 1}}, {"pk": 15, "model": "news.news", "fields": {"external_news_link": "", "title": "Policy Change", "text": "<p>Effective May 1, 2016, the 7 Day Flex Fare will no longer be offered. &nbsp;Only Standard Fares will be offered. &nbsp;Standard fares will be non-refundable and non-transferrable. &nbsp;Tickets purchased must be used for the date and time originally booked. &nbsp;Time changes will only be permitted if passenger is upgrading to a Red Arrow departure on the same day. &nbsp;Red Arrow tickets that have been upgraded from ebus are also non-refundable. &nbsp;&nbsp;Missed departures will result in forfeiture of fare and a new full fare will need to be purchased for travel.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "policy-change", "teaser": "Policy Change", "publish_date": "2016-04-27", "display_order": 1}}, {"pk": 16, "model": "news.news", "fields": {"external_news_link": "", "title": "CrossIron Mills Shopping Shuttle Starts July 1, 2016", "text": "<p>The CrossIron Mills Shopping Shuttle will begin service on July 1, 2016, and will run throughout the summer untii September 5, 2016. &nbsp;Round trip fares are only $15.00 per person. &nbsp;In celebration of Canada Day, all passengers are able to ride free of charge. &nbsp;Reservations are still required however. &nbsp;Click <a href=\"http://myebus.ca/crossiron-mills-shuttle\">here</a> to view the daily schedule.</p>", "image": "/customer_media/news/news.jpg", "is_active": true, "slug": "crossiron-mills-shuttle-starts-july-1-2016", "teaser": "Plan Your Shopping Trip Today", "publish_date": "2016-06-29", "display_order": 1}}]